"""场地参数 """
L = 150                # 场地边长（单位：米）
TARGET = (0, 0)        # 目标区域坐标
MAX_STEPS = 8000       # 最大迭代步数
TARGET_RADIUS = 10     # 目标区域半径（米）

"""羊参数"""
N = 100                 # 羊数量50
n_neighbors = 30       # 每个羊感知的最近邻居数量26
r_s = 65               # 牧羊犬排斥半径（米）
r_a = 2                # 羊间排斥作用半径（米）2
v_a = 1.0              # 羊移动速度（米/步）
rho_a = 2.0            # 羊间排斥力权重2
c = 1.05               # 邻居吸引力权重1.05
rho_s = 1.0            # 牧羊犬排斥力权重
h = 0.5                # 惯性权重
epsilon = 0.3          # 随机移动权重

"""牧羊犬参数"""
v_s = 1.5              # 牧羊犬移动速度（米/步）
blind_angle = 3.1416/2 # 盲区角度（π/2弧度）
